index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-06 Tue 11:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Case Notes and Questions</title>
<meta name="author" content="Matt Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Case Notes and Questions</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org12b72b8">1. Concepts to Review/Highlight:</a>
<ul>
<li><a href="#orgd8091d6">1.1. Goal of the firm</a></li>
<li><a href="#org65ed442">1.2. Ownership of the firm</a></li>
<li><a href="#org8342d9e">1.3. Agency Problem and its resolutions through the Takeover (market for corporate control)</a></li>
<li><a href="#orgd06bd33">1.4. Du Pont Identity</a></li>
</ul>
</li>
<li><a href="#org15b127d">2. Discussion Questions</a></li>
<li><a href="#orgcbd499e">3. Method</a></li>
<li><a href="#org08043f9">4. Case Analysis</a></li>
<li><a href="#orgbfc2ff0">5. Case Question</a></li>
</ul>
</div>
</div>


<div id="outline-container-org12b72b8" class="outline-2">
<h2 id="org12b72b8"><span class="section-number-2">1.</span> Concepts to Review/Highlight:</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd8091d6" class="outline-3">
<h3 id="orgd8091d6"><span class="section-number-3">1.1.</span> Goal of the firm</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The relationship between the goal of the firm and US state laws of incorporation.  Brief note of laws in other countries.
</p>
</div>
</div>
<div id="outline-container-org65ed442" class="outline-3">
<h3 id="org65ed442"><span class="section-number-3">1.2.</span> Ownership of the firm</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Who owns the firm's and how do they exercise control over the firm?</li>
<li>Two aspects of ownership, (1) control and (2) residual claim on cash flows.</li>
<li>Did Ben and Jerry's charter attempt to separate the two aspects of ownership?</li>
</ul>
</div>
</div>
<div id="outline-container-org8342d9e" class="outline-3">
<h3 id="org8342d9e"><span class="section-number-3">1.3.</span> Agency Problem and its resolutions through the Takeover (market for corporate control)</h3>
</div>
<div id="outline-container-orgd06bd33" class="outline-3">
<h3 id="orgd06bd33"><span class="section-number-3">1.4.</span> Du Pont Identity</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The ROE is mentioned throughout the case as a performance metric.  Show the drivers of ROE through the Du Pont identity.  
</p>

<p>
\[ROE = (Profit\ Margin)(Total\ Asset\ Turnover)(Equity\ Multiplier)\]
</p>
</div>
</div>
</div>

<div id="outline-container-org15b127d" class="outline-2">
<h2 id="org15b127d"><span class="section-number-2">2.</span> Discussion Questions</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>What was Jerry's IPO method and what effect did it have on:
<ul class="org-ul">
<li>The amount of capital raised.</li>
<li>The control of the firm.</li>
</ul></li>
<li>What do you think of the interview on page 42? Would this make you more or less confident to invest in Ben and Jerry's?  Possibly consider this question in relation to the following anecdote on page 42.</li>
<li>How do we want management to increase ROE, and alternatively what method is irrelevant?</li>
<li>What do you think is the correlation, if any, between "caring capitalism" and the stock price?  Consider the mission statement on page 43.</li>
<li>Why did Ben and Jerry's have differential voting rights?</li>
<li>What was the effect of the corporate charter restrictions (page 44).  Do they make changes easier or more difficult? Do they increase or decrease the founders' (Ben and Jerry) control.</li>
<li>Thoughts on 1998 amendments to Vermont Incorporation?  Would you be more/less likely to locate your business in Vermont?</li>
<li>The text alludes to "Ben and Jerry's declining financial performance" on page 1.  Do you think the company's performance is poor/declining?</li>
<li>In the conclusion Harry Morgan says ROE is 7%, and that is "lousy by any measure".  Is it really lousy and does that mean the firm should be sold?</li>
<li>pg 39, "declining financial performance triggered a number of takeover offers".  pg 45 <i>The Offers</i> section says they pursued a joint venture due to competition, and when this didn't work Ben and Jerry's got takeover offers.  Do these sections agree?</li>
</ol>
</div>
</div>

<div id="outline-container-orgcbd499e" class="outline-2">
<h2 id="orgcbd499e"><span class="section-number-2">3.</span> Method</h2>
<div class="outline-text-2" id="text-3">
<p>
You can approximate how much Ben and Jerry's is worth if it were a subsidiary of another firm by applying the other firms P/E multiple to Ben and Jerrys' earnings.  Note, Ben and Jerry's shareholders don't get this value&#x2014;they get the acquisition price.  What it does give you is an idea of how undervalued Ben and Jerry's presently is.  This can be evidence of mismanagement&#x2014;or evidence of nothing.
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #ff98a4;">new_BJ_price</span> = 47.2 * 1.06 <span style="color: #7a88cf;">## </span><span style="color: #7a88cf;">Dryers P/E * BJ EPS</span>

<span style="color: #c099ff;">print</span>(<span style="color: #c3e88d;">"$"</span>, <span style="color: #c099ff;">round</span>(new_BJ_price, 2))

</pre>
</div>

<pre class="example">
$ 50.03
</pre>
</div>
</div>


<div id="outline-container-org08043f9" class="outline-2">
<h2 id="org08043f9"><span class="section-number-2">4.</span> Case Analysis</h2>
<div class="outline-text-2" id="text-4">
<pre class="example" id="org1853cb4">
Pros/cons of each offer, which would you choose (this is the formal case analysis)?
</pre>
</div>
</div>

<div id="outline-container-orgbfc2ff0" class="outline-2">
<h2 id="orgbfc2ff0"><span class="section-number-2">5.</span> Case Question</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2022-09-06 Tue 11:02</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
